src/VirtualClient/VirtualClient.Actions.UnitTests/Examples/Memtier/Memtier_Memcached_Results_4.txt
4         Threads
1         Connections per thread
60        Seconds


ALL STATS
============================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p90 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec
------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets         4706.32          ---          ---         2.70510         2.86300         4.06300         4.57500         7.35900        24.83100       321.21
Gets        42356.45     42356.45         0.00         2.68904         2.81500         4.03100         4.54300         7.32700        24.70300      3630.78
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---          ---
Totals      47062.77     42356.45         0.00         2.69065         2.81500         4.04700         4.54300         7.32700        24.70300      3951.99


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.063        0.000
SET       0.407        5.000
SET       0.623       10.000
SET       0.951       15.000
SET       1.351       20.000
SET       1.711       25.000
SET       2.031       30.000
SET       2.287       35.000
SET       2.511       40.000
SET       2.703       45.000
SET       2.863       50.000
SET       2.943       52.500
SET       3.007       55.000
SET       3.071       57.500
SET       3.119       60.000
SET       3.167       62.500
SET       3.199       65.000
SET       3.247       67.500
SET       3.311       70.000
SET       3.375       72.500
SET       3.439       75.000
SET       3.487       76.250
SET       3.519       77.500
SET       3.567       78.750
SET       3.615       80.000
SET       3.663       81.250
SET       3.695       82.500
SET       3.743       83.750
SET       3.807       85.000
SET       3.855       86.250
SET       3.919       87.500
SET       3.951       88.125
SET       3.983       88.750
SET       4.015       89.375
SET       4.063       90.000
SET       4.127       90.625
SET       4.159       91.250
SET       4.223       91.875
SET       4.287       92.500
SET       4.351       93.125
SET       4.415       93.750
SET       4.447       94.062
SET       4.479       94.375
SET       4.543       94.688
SET       4.575       95.000
SET       4.639       95.312
SET       4.703       95.625
SET       4.799       95.938
SET       4.863       96.250
SET       4.959       96.562
SET       5.087       96.875
SET       5.183       97.031
SET       5.247       97.188
SET       5.343       97.344
SET       5.439       97.500
SET       5.567       97.656
SET       5.727       97.812
SET       5.855       97.969
SET       6.015       98.125
SET       6.207       98.281
SET       6.431       98.438
SET       6.527       98.516
SET       6.655       98.594
SET       6.751       98.672
SET       6.879       98.750
SET       7.039       98.828
SET       7.167       98.906
SET       7.327       98.984
SET       7.487       99.062
SET       7.679       99.141
SET       7.871       99.219
SET       7.999       99.258
SET       8.127       99.297
SET       8.255       99.336
SET       8.511       99.375
SET       8.639       99.414
SET       8.831       99.453
SET       9.023       99.492
SET       9.279       99.531
SET       9.535       99.570
SET       9.919       99.609
SET      10.047       99.629
SET      10.303       99.648
SET      10.559       99.668
SET      10.879       99.688
SET      11.455       99.707
SET      11.903       99.727
SET      12.735       99.746
SET      13.503       99.766
SET      14.783       99.785
SET      15.871       99.805
SET      16.511       99.814
SET      17.407       99.824
SET      18.175       99.834
SET      18.687       99.844
SET      19.711       99.854
SET      20.991       99.863
SET      21.887       99.873
SET      23.295       99.883
SET      24.319       99.893
SET      25.215       99.902
SET      25.727       99.907
SET      26.239       99.912
SET      26.751       99.917
SET      27.775       99.922
SET      28.415       99.927
SET      29.183       99.932
SET      29.695       99.937
SET      30.463       99.941
SET      30.975       99.946
SET      31.871       99.951
SET      32.255       99.954
SET      33.023       99.956
SET      33.535       99.958
SET      33.535       99.961
SET      34.047       99.963
SET      34.559       99.966
SET      35.327       99.968
SET      36.095       99.971
SET      37.631       99.973
SET      39.167       99.976
SET      39.423       99.977
SET      40.959       99.978
SET      41.215       99.979
SET      41.983       99.980
SET      43.263       99.982
SET      43.519       99.983
SET      46.079       99.984
SET      46.335       99.985
SET      46.847       99.987
SET      48.383       99.988
SET      48.639       99.988
SET      48.895       99.989
SET      49.151       99.990
SET      49.663       99.990
SET      49.663       99.991
SET      49.663       99.991
SET      50.175       99.992
SET      50.431       99.993
SET      51.711       99.993
SET      51.711       99.994
SET      51.711       99.994
SET      52.223       99.995
SET      52.223       99.995
SET      52.223       99.995
[...]
SET      52.223       99.996
SET      52.223       99.996
SET      52.479       99.996
SET      52.479       99.997
SET      52.479       99.997
SET      52.479       99.997
[...]
SET      55.039       99.998
SET      55.039       99.998
SET      55.039       99.998
[...]
SET      55.295       99.998
SET      55.295       99.998
SET      55.295       99.999
SET      60.159       99.999
SET      60.159      100.000
---
GET       0.063        0.000
GET       0.431        5.000
GET       0.703       10.000
GET       1.015       15.000
GET       1.375       20.000
GET       1.695       25.000
GET       1.999       30.000
GET       2.255       35.000
GET       2.463       40.000
GET       2.639       45.000
GET       2.815       50.000
GET       2.895       52.500
GET       2.975       55.000
GET       3.023       57.500
GET       3.087       60.000
GET       3.135       62.500
GET       3.183       65.000
GET       3.231       67.500
GET       3.279       70.000
GET       3.343       72.500
GET       3.407       75.000
GET       3.455       76.250
GET       3.487       77.500
GET       3.535       78.750
GET       3.583       80.000
GET       3.631       81.250
GET       3.679       82.500
GET       3.727       83.750
GET       3.775       85.000
GET       3.823       86.250
GET       3.887       87.500
GET       3.919       88.125
GET       3.951       88.750
GET       3.999       89.375
GET       4.031       90.000
GET       4.079       90.625
GET       4.127       91.250
GET       4.191       91.875
GET       4.255       92.500
GET       4.319       93.125
GET       4.383       93.750
GET       4.415       94.062
GET       4.447       94.375
GET       4.511       94.688
GET       4.543       95.000
GET       4.607       95.312
GET       4.671       95.625
GET       4.767       95.938
GET       4.831       96.250
GET       4.927       96.562
GET       5.055       96.875
GET       5.151       97.031
GET       5.215       97.188
GET       5.311       97.344
GET       5.407       97.500
GET       5.535       97.656
GET       5.695       97.812
GET       5.823       97.969
GET       5.983       98.125
GET       6.175       98.281
GET       6.367       98.438
GET       6.495       98.516
GET       6.623       98.594
GET       6.719       98.672
GET       6.847       98.750
GET       7.007       98.828
GET       7.135       98.906
GET       7.295       98.984
GET       7.455       99.062
GET       7.615       99.141
GET       7.839       99.219
GET       7.967       99.258
GET       8.095       99.297
GET       8.255       99.336
GET       8.447       99.375
GET       8.639       99.414
GET       8.831       99.453
GET       9.023       99.492
GET       9.279       99.531
GET       9.535       99.570
GET       9.855       99.609
GET      10.047       99.629
GET      10.239       99.648
GET      10.495       99.668
GET      10.879       99.688
GET      11.391       99.707
GET      11.839       99.727
GET      12.671       99.746
GET      13.375       99.766
GET      14.399       99.785
GET      15.679       99.805
GET      16.511       99.814
GET      17.151       99.824
GET      18.047       99.834
GET      18.687       99.844
GET      19.711       99.854
GET      20.863       99.863
GET      21.631       99.873
GET      23.039       99.883
GET      24.191       99.893
GET      24.831       99.902
GET      25.471       99.907
GET      26.239       99.912
GET      26.751       99.917
GET      27.647       99.922
GET      28.415       99.927
GET      29.183       99.932
GET      29.695       99.937
GET      30.335       99.941
GET      30.975       99.946
GET      31.743       99.951
GET      32.127       99.954
GET      33.023       99.956
GET      33.279       99.958
GET      33.791       99.961
GET      34.047       99.963
GET      34.303       99.966
GET      34.815       99.968
GET      35.839       99.971
GET      37.375       99.973
GET      39.167       99.976
GET      39.167       99.977
GET      40.703       99.978
GET      41.215       99.979
GET      41.215       99.980
GET      42.239       99.982
GET      43.263       99.983
GET      45.311       99.984
GET      46.079       99.985
GET      46.847       99.987
GET      47.871       99.988
GET      48.383       99.988
GET      48.383       99.989
GET      49.151       99.990
GET      49.151       99.990
GET      49.663       99.991
GET      49.663       99.991
GET      50.175       99.992
GET      50.431       99.993
GET      50.943       99.993
GET      51.711       99.994
GET      51.711       99.994
GET      51.711       99.995
GET      51.967       99.995
GET      52.223       99.995
GET      52.223       99.995
GET      52.223       99.996
GET      52.223       99.996
GET      52.223       99.996
GET      52.479       99.997
GET      52.479       99.997
GET      52.479       99.997
[...]
GET      52.479       99.998
GET      52.479       99.998
GET      55.039       99.998
GET      55.039       99.998
GET      55.039       99.998
[...]
GET      55.039       99.999
GET      55.295       99.999
GET      55.295       99.999
GET      55.295       99.999
[...]
GET      60.159       99.999
GET      60.159      100.000
---
WAIT      0.000      100.000